// walk(document.body);

// function walk(node) {


// 	var child, next;

// 	switch (node.nodeType) {
// 		case 1:
// 		case 9:
// 		case 11:
// 			child = node.firstChild;
// 			while (child) {
// 				next = child.nextSibling;
// 				walk(child);
// 				child = next;
// 			}
// 			break;

// 		case 3:
// 			makeItCultural(node);
// 			break;
// 	}
// }

// function makeItCultural(textNode) {
// 	var text = textNode.nodeValue;

// 	// ТаблицаAntiProfanity2 ( Обновление 1.22.12

// 	text = text.replace(/плохое словоа(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоа(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоб(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоб(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словов(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словов(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["пплохое слово"]));
// 	text = text.replace(/плохое словог(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словог(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словод(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словод(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словое(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словое(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоё(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоё(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словож(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словож(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоз(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоз(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словои(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словои(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словой(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словой(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словок(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словок(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словол(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словол(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словом(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словом(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словон(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словон(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоо(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоо(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоп(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоп(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словор(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словор(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словос(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словос(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словот(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словот(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоу(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоу(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоф(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоФ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словох(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словох(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоц(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоц(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоЧ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоч(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словош(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словош(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словощ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словощ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоь(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоь(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоъ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоъ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоэ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоэ(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словою(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словою(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоя(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/g, randomWord(["плохое слово"]));
// 	text = text.replace(/плохое словоя(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)/i, randomWord(["плохое слово"]));

// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)аплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)аплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)бплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)бплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)вплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)вплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)гплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)гплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)дплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)дплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)еплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)еплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ёплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ёплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)жплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)жплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)зплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)зплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)иплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)иплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)йплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)йплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)кплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)кплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)лплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)лплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)мплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)мплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)нплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)нплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)оплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)оплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)пплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)пплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)рплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)рплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)сплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)сплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)тплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)тплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)уплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)уплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)фплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)Фплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)хплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)хплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)цплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)цплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)Чплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)чплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)шплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)шплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)щплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)щплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ьплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ьплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ъплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)ъплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)эплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)эплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)юплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)юплохое слово/i, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)яплохое слово/g, randomWord(["плохое слово"]));
// 	text = text.replace(/(а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ъ|ы|э|ю|я)яплохое слово/i, randomWord(["плохое слово"]));



// 	// ТаблицаАнтиМат2 ) Обновление 1.22.12


// 	textNode.nodeValue = text;
// }
// function randomWord(words) {
// 	return words[Math.floor(Math.random() * words.length)];
// }


